In [71]:
import pandas as pd

df = pd.read_csv('csv_data/a1.csv')
df

     姓名  國文  英文  數學  自然   社會
0   鄭佳玲  62  82  75  52  100
1   梁柏宇  99  52  57  66   70
2   王品星  70  51  70  87   57
3   郭坤花  62  74  55  95   70
4   陳淑萍  67  93  82  56   80
5   葉志峰  96  66  80  73   96
6   陳得映  70  59  91  62   72
7   孫火清  59  91  78  60   58
8   余月修  51  57  74  81   70
9   林冠蕙  87  88  65  98  100
10  黃必琪  68  60  90  95   82
11  陳信宏  51  66  58  99   72
12  洪阿惠  88  73  92  56   72
13  陳信念  91  59  50  96   90
14  高信宏  77  86  87  74   76
15  李湘婷  74  76  62  60   84
16  陳逸華  51  65  55  76   98
17  吳俐芷  66  76  70  87   62
18  詹忠光  90  54  67  78   81
19  鄧哲榮  83  69  78  85   87
20  劉旭士  57  84  96  58   92
21  張雅芬  65  79  51  51   89
22  陳冠霞  51  95  51  78   51
23  蔡偉成  90  94  62  94   93
24  張莉雯  64  55  76  60   62
25  賴心怡  65  63  90  60   54
26  張牧聿  50  91  60  96   81
27  劉萬季  80  70  93  90   67
28  游淑惠  79  71  76  99   86
29  林怡偉  82  54  82  82   81
30  吳明妮  82  65  99  98   76
31  李湘婷  62  53  82  94   87
32  游一鈺  69  89  94  70   98
33  鄭淑珍  70  67  71  70   50
34  王志謙  71  91  88  66   76
35  陳倩妮  91  84  85  72   69
36  李慈啟  99  65  67  87   73
37  陳家維  91  66  99  93   82
38  龐皓芳  70  70  72  66   81
39  許淑婷  90  53  50  78   85
40  陳怡容  79  94  73  68   81
41  黃佩玲  69  86  53  92   93
42  林群清  51  60  83  51   78
43  馬彥文  88  61  96  70   95
44  李政成  78  59  63  72   84

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45 entries, 0 to 44
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   姓名      45 non-null     object
 1   國文      45 non-null     int64
 2   英文      45 non-null     int64
 3   數學      45 non-null     int64
 4   自然      45 non-null     int64
 5   社會      45 non-null     int64
dtypes: int64(5), object(1)
memory usage: 2.2+ KB

In [73]:
s1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
s1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [74]:
s1.reindex(['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [75]:
s1.reindex(['a','b','c'])

a   -5.3
b    7.2
c    3.6
dtype: float64

In [76]:
s2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
s2

0      blue
2    purple
4    yellow
dtype: object

In [77]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.arange(9).reshape(3,3),
             index=['a','c','d'],
             columns=['台北', '台中', '高雄'])
df

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [78]:
df.reindex(['a','b','c','d'])

    台北   台中   高雄
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0

In [79]:
df.reindex(['a','c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [80]:
df.reindex(columns=['台北','高雄'])

   台北  高雄
a   0   2
c   3   5
d   6   8

In [81]:
df[['台北','高雄']]

   台北  高雄
a   0   2
c   3   5
d   6   8

In [82]:
df.reindex(columns=['台北','高雄'],index=['a','d'])

   台北  高雄
a   0   2
d   6   8

In [83]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [84]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [85]:
data.drop(['台北','台中'],axis=0)

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [86]:
data.drop(['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [87]:
data.drop(['one','two'],axis='columns')

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [88]:
data.drop('台北',inplace=True)#預設inplace=False傳出新的資料，而inplace=True就是不傳出直接刪除資料

In [89]:
data

    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15